package alphawolf.wolfpack.ajaysharvesh.kanithamizh;

import android.content.Context;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.TextView;

/**
 * Created by ajays on 1/18/2018.
 */

public class CustomAdaptor extends BaseAdapter {

    Context c;

    public String[] topics = {"1. கடவுள் வாழ்த்து", "2. வான்சிறப்பு", "3. நீத்தார் பெருமை", "4. அறன் வலியுறுத்தல்", "5. இல்வாழ்க்கை", "6. வாழ்க்கைத் துணைநலம்",
            "7. மக்கட்பேறு", "8. அன்புடைமை", "9. விருந்தோம்பல்", "10. இனியவை கூறல்", "11. செய்ந்நன்றியறிதல்", "12. நடுவு நிலைமை", "13. அடக்கம் உடைமை", "14. ஒழுக்கம் உடைமை", "15. பிறனில் விழையாமை",
            "16. பொறையுடைமை", "17. அழுக்காறாமை", "18. வெஃகாமை", "19. புறங்கூறாமை", "20. பயனில சொல்லாமை", "21. தீவினையச்சம்", "22. ஒப்புரவறிதல்", "23. ஈ.கை", "24. புகழ்",
            "25. அருளுடைமை", "26. புலால் மறுத்தல்", "27. தவம்", "28. கூடா ஒழுக்கம்", "29. கள்ளாமை", "30. வாய்மை", "31. வெகுளாமை", "32. இன்னா செய்யாமை", "33. கொல்லாமை", "34. நிலையாமை",
            "35. துறவு", "36. மெய்யுணர்தல்", "37. அவா அறுத்தல்", "38. ஊழ்", "39. இறைமாட்சி", "40. கல்வி", "41. கல்லாமை", "42. கேள்வி", "43. அறிவுடைமை", "44. குற்றங்கடிதல்", "45. பெரியாரைத் துணைக்கோடல்",
            "46. சிற்றினம் சேராமை", "47. தெரிந்து செயல்வகை", "48. வலியறிதல்", "49. காலமறிதல்", "50. இடனறிதல்", "51. தெரிந்து தெளிதல்", "52. தெரிந்து வினையாடல்", "53. சுற்றந் தழால்", "54. பொச்சாவாமை", "55. செங்கோன்மை", "56. கொடுங்கோன்மை", "57. வெருவந்த செய்யாமை", "58. கண்ணோட்டம்", "59. ஒற்றாடல்",
            "60. ஊக்கம் உடைமை", "61. மடி இன்மை", "62. ஆள்வினை உடைமை", "63. இடுக்கண் அழியாமை", "64. அமைச்சு", "65. சொல்வன்மை", "66. வினைத் தூய்மை", "67. வினைத்திட்பம்", "68. வினை செயல்வகை", "69. தூது", "70. மன்னரைச் சேர்ந்து ஒழுகல்",
            "71. குறிப்பறிதல்", "72. அவை அறிதல்", "73. அவை அஞ்சாமை", "74. நாடு", "75. அரண்", "76. பொருள் செயல்வகை", "77. படை மாட்சி", "78. படைச் செருக்கு", "79. நட்பு", "80. நட்பாராய்தல்",
            "81. பழைமை", "82. தீ நட்பு", "83. கூடா நட்பு", "84. பேதைமை", "85. புல்லறிவாண்மை", "86. இகல்", "87. பகை மாட்சி", "88. பகைத்திறம் தெரிதல்", "89. உட்பகை", "90. பெரியாரைப் பிழையாமை",
            "91. பெண்வழிச் சேறல்", "92. வரைவின் மகளிர்", "93. கள்ளுண்ணாமை", "94. சூது", "95. மருந்து", "96. குடிமை", "97. மானம்", "98. பெருமை", "99. சான்றாண்மை", "100. பண்புடைமை",
            "101. நன்றியில் செல்வம்", "102. நாணுடைமை", "103. குடிசெயல் வகை", "104. உழவு", "105. நல்குரவு", "106. இரவு", "107. இரவச்சம்", "108. கயமை", "109. தகை அணங்குறுத்தல்", "110. குறிப்பறிதல்",
            "111. புணர்ச்சி மகிழ்தல்", "112. நலம் புனைந்து உரைத்தல்", "113. காதற் சிறப்புரைத்தல்", "114. நாணுத் துறவுரைத்தல்", "115. அலர் அறிவுறுத்தல்", "116. பிரிவு ஆற்றாமை", "117. படர்மெலிந் திரங்கல்", "118. கண் விதுப்பழிதல்", "119. பசப்புறு பருவரல்", "120. தனிப்படர் மிகுதி",
            "121. நினைந்தவர் புலம்பல்", "122. கனவுநிலை உரைத்தல்", "123. பொழுதுகண்டு இரங்கல்", "124. உறுப்புநலன் அழிதல்", "125. நெஞ்சொடு கிளத்தல்", "126. நிறையழிதல்", "127. அவர்வயின் விதும்பல்", "128. குறிப்பறிவுறுத்தல்", "129. புணர்ச்சி விதும்பல்", "130. நெஞ்சொடு புலத்தல்", "131. புலவி", "132. புலவி நுணுக்கம்", "133. ஊடலுவகை"};

    public String[] topics1 = {"அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்",
            "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்",
            "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்",
            "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்",
            "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "அறத்துப்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்",
            "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்",
            "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்",
            "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்",
            "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்",
            "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்",
            "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்", "பொருட்பால்",
            "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்",
            "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்",
            "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்", "காமத்துப்பால்"};

    public CustomAdaptor(Context ctx) {
        this.c = ctx;
    }

    @Override
    public int getCount() {
        return topics.length;
    }

    @Override
    public Object getItem(int position) {
        return topics[position];
    }

    @Override
    public long getItemId(int position) {
        return position;
    }

    @Override
    public View getView(int position, View convertView, ViewGroup parent) {

        if (convertView == null) {

            LayoutInflater inflater = (LayoutInflater) c.getSystemService(c.LAYOUT_INFLATER_SERVICE);
            convertView = inflater.inflate(R.layout.list_item, null);

        }


        //get view

        TextView t1 = (TextView) convertView.findViewById(R.id.label);
        TextView t2 = (TextView) convertView.findViewById(R.id.label2);

        //ImageView iv = (ImageView) convertView.findViewById(R.id.image10);

        //set data

        t1.setText(topics[position]);
        t2.setText(topics1[position]);

        return convertView;

    }
}
